lukesmithuk/esp32-simple-picture-frame/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM — octal, 80 MHz, integrated into heap
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Stack / heap
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FAT filesystem — long filename support for SD card
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# WiFi — push lwIP buffers to PSRAM to free internal DRAM
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Partition table — single factory app, no OTA
CONFIG_PARTITION_TABLE_SINGLE_APP=y
